from konlpy.tag import Kkma
from konlpy.utils import pprint
kkma = Kkma()

import re
pattern_kor = re.compile(r'[^0-9]*')
pattern_short = re.compile(r'[1-9]0대\s*[가-힣]{0,10}')
pattern_long = re.compile(r'[가-힣]{0,10}\s*[가-힣]{0,10}\s*[1-9]0대\s*[가-힣]{0,10}\s*[가-힣]{0,10}')


fr = open('/home/s20131533/pycharm_numbertoword/filtered/대_filtered.txt', 'r', encoding='UTF8')
#fw = open('filtered/103_237_filtered.txt', 'w')
fw = open('대_nouns.txt','w')

total = fr.readlines()

text_list = []


human = ['남성', '장애인', '조선족', '여성', '고교', '연령층', '미성년자', '할머니', '부부', '씨', '후반', '초반', '세탁', '여학생', '미혼', '고객', '초반', '장인', '중반', '아들', '가장', '실직', '직원', '꽃뱀', '노인', '일용직', '사진사', '한국인', '주차', '입주민', '경비원', '어머니', '취객', '아파트', '주민', '경찰관', '전직', '교사', '중반', '수배', '직장인', '카페', '주인', '도둑', '집주인', '고령', '엘리트', '이웃', '이혼녀', '장애', '손님', '백화점', '소년', '이웃집', '신원', '미상', '교직원', '초등학교', '신불', '부모', '노부', '층', '희생자', '업자', '이모', '청년층', '피의자', '디자이너', '동포', '여고생', '남매', '인질', '고교생', '인질범', '남', '남편', '보육', '남녀', '학생', '중국인', '때', '연인', '싱글', '맘', '청년', '소녀', '자살률', '여교사', '방', '엄마', '사이비', '후보', '법관', '딜러', '역술인', '재미', '교수', '회사원', '내연', '남자', '시절', '구속', '동포', '이복', '누나', '실종', '청소년', '교회', '선배', '피고인', '누리꾼', '조기', '조합원', '돌보미', '군', '포섭', '정신', '영어', '학원', '조직원', '의사', '수사', '피해자', '절도범', '귀농','구속이웃', '징역형', '징역형남녀노소', '남녀노소', '귀', '귀촌', '촌', '공갈', '공갈단', '단', '심모', '심모씨', '딸', '귀농부부', '단원', '예술', '예술감독', '감독', '대기업', '일본', '선원', '관리', '관리대상', '대상', '아내', '강모', '어머니여', '여', '정신과', '신경', '신경정신', '환자', '데', '데시인', '시인', '여동생', '조폭', '조직', '조직폭력배', '폭력배', '사업가', '여비서', '무직자', '채', '여종업원', '재력가', '공무원', '건물', '건물관리인', '관리인', '재력', '재력가인', '가인', '비서', '치매', '예비', '예비아빠', '아빠', '그룹', '여대생', '용의자', '사병', '영어교사', '폭력', '세무', '제자', '여군', '뺑소니', '화물차', '징역', '간호', '간호조무사', '조', '무사', '간호조무', '조무', '산모', '어린이', '어린이집', '집', '대학생', '노모', '학원강사', '강사', '중', '중후반', '원장', '유학생', '일당', '자동차', '두', '도둑커플', '커플', '의붓딸', '마트', '중학생', '운전자', '속인', '외제', '외제차', '차', '할아버지', '아우', '아우디', '디', '재벌', '기업', '질주', '남학생', '노동자', '가량', '주부', '검거', '검거외국계', '외국계', '등산객', '임신부', '매몰', '청와대', '호스트', '호스트바', '바', '당원', '정신분열병', '분열병', '클럽', '클럽여직원', '여직원', '여성대원', '대원', '여성교사', '아버지', '추정', '버스', '버스기사', '기사', '연인사이', '사이', '외국인', '모친', '형', '성인', '세입자', '덤프', '덤프트럭', '트럭', '고등', '고등학교', '학교', '유부남', '배낭', '배낭여행객', '여행객', '모로코', '모로코인의', '인의', '종업원', '세', '성폭행', '봉제', '봉제공장', '공장', '노조', '대의원', '수련', '차모', '차모씨', '만', '이력서', '겐', '중장년층', '장년층', '협박', '내연녀', '녀', '정씨', '서', '서씨', '행인', '사기범', '이', '기혼', '숙박업', '숙박업주가', '주가', '독신', '여자', '오', '다리', '가출', '경찰', '범행', '허', '허모씨', '치매노인', '중년', '강', '송', '강모씨', '과외', '과외교사', '비중', '목', '자산가', '사위', '아저씨', '노령', '출마자', '피의자', '형제간', '경우', '형수', '동생', '형과', '상습', '급증', '급증혼탁', '혼탁', '긴급', '긴급체포충북', '체포', '충북', '마약', '친형', '의식', '영장', '영장서울', '서울', '구속항', '항', '여제자', '방화범', '남성환자', '강도', '가출청소년', '고교동창', '동창', '독거', '독거노인', '경이', '대비', '덜미', '아이', '아이돌그룹', '언니', '음악', '음악교사', '연예', '연예기획사', '기획사', '무명', '바바리', '바바리맨', '맨', '청각', '청각장애', '새', '새터민', '터', '민', '무속', '무속인과', '인과', '정신분열증', '분열증', '스포츠', '이사장', '도주', '오빠', '나이', '불량', '불량청소년', '긴급체포', '미국인', '가출소녀', '재판', '취업', '인도', '총선', '천안', '법원장', '정모', '정모씨', '사설', '초청', '초청강사', '살인범', '개인', '개인택시', '택시', '캐디', '근로', '근로자로', '자로', '사회', '사회복무요원', '복무', '요원', '었습', '니', '환경', '환경미화원', '미화원', '이모씨', '혁신', '혁신대책', '대책', '여주인', '식당', '실형', '만취', '정신지체장애인', '중형', '부가', '노숙인', '일', '사망률', '인재', '대학원', '젊은이', '자매', '패륜', '직장', '배치', '태국', '일본인', '사기꾼', '심', '행동', '행동대장', '대장', '과의', '인부', '털이', '털이범', '신모', '신모씨', '여아', '여중생', '최', '최모씨', '질식', '신규', '마약범', '택시기사', '가출소', '강도단', '쌍둥이', '혼성', '마약사범', '사범', '전문직', '대학교수', '제주', '제주도', '제주도민', '도', '화가', '시어머니', '선적', '중앙', '중앙부처', '부처', '수용자', '실향민', '패륜남', '전국', '전국우정노조', '우정', '미국', '연소', '불', '압수', '조모', '조모씨', '도망자', '구속정부', '정부', '구속패스트푸드점', '패스트푸드점', '전문', '골프', '동포여성', '전자', '전자발찌', '발찌', '미혼모', '동거', '항소심', '백골', '고집', '고집불통', '불통', '취업준비', '준비', '택배', '택배기사', '해녀', '명문대', '검사', '헬스장', '유형', '목사', '구원', '구원파', '파', '독일인', '회원', '조카', '손모', '손모씨승객', '승객', '학', '학원생', '원생', '학원장', '집행', '집행유예', '유예', '전과자', '폭행', '입건', '대한', '대한민국', '민국', '북', '건설', '건설현장', '현장', '구속사회경험', '경험', '스토커', '성범죄', '모범', '모범무기수', '무기수', '불법', '불법체류', '체류', '수감자', '시각', '시각장애인', '한인', '보석', '보석중개인', '중개인', '어르신', '문구점', '국회의원', '학도', '동거녀', '부친', '자녀', '국회', '병원', '응급', '응급처치경찰', '처치', '가정주부', '사기단', '여기자', '추행', '매니저', '구속알코올', '알코올', '중증', '중증장애', '총선거', '검거서울', '구속기소', '기소', '흉기', '부동산', '커피나', '비율', '전화', '전화금융사기', '금융', '사기', '계모', '자전거', '자전거전문', '폭력조직', '구속서울', '외국', '여자친구', '친구', '봉사자', '물', '포스', '포스코', '코', '이종', '이종격투기', '격투기', '지제', '지제장애인', '스파이', '견인차', '사장', '명품', '명품무기', '무기', '가운데', '외의', '동네', '동네조폭', '업주', '공모자', '예비군', '전자팔찌', '팔찌', '만이', '여성환자', '저수지', '익사', '마약제조업자', '제조', '다이버', '소개', '소개업체', '업체', '숙련공', '여사원', '발달', '발달장애인', '구속기소수원지검', '수원', '지검', '구속위조', '위조', '신혼부부', '정치인', '공중', '공중보건의가', '보건', '의가', '트렌스', '트렌스젠더', '젠더', '나모', '나모씨', '시', '시매부가', '매', '막내', '자살', '인물', '스쿨', '전후', '점유', '점유이탈물횡령', '이탈물', '횡령', '북여성', '붓', '붓어머니', '입건금속탐지기', '금속', '탐지기', '몽골인', '독립', '독립영화', '영화', '구속지난달', '지난달', '덤프트럭기사', '노인폭행', '시외버스', '국기', '옛', '펌', '검거전국', '여성운전자', '성희롱', '노인폭행사건', '사건', '고령자', '약사', '사망자', '미국입양아', '입양아', '사망', '뿐', '여인', '차량', '차량털이범', '구속은행', '은행', '프랑스인', '선', '순', '미만', '메', '메르', '르', '부부싸움', '싸움', '시민', '사도', '간호사', '스리', '카인', '중동', '중동호흡기증후군', '호흡기', '증후군', '칼부림', '고등학생', '점', '점장과', '장과', '감염자', '보건복지부와', '복지', '부와', '진', '양성', '철', '철원지역', '원지', '역', '유명', '진자', '임산부', '참가', '여류', '여류화가', '보안', '보안요원', '학부모', '정규직', '삼성', '삼성서울병원', '공익', '공익요원', '선거', '초보', '초보운전자', '환자이자', '이자', '외과', '정신지체장애', '광주', '광주고법', '고법', '보행자', '터키인', '북한군', '남자가요', '가요', '자택', '슈퍼마켓', '범인', '중동호흡기중후군', '후군', '고소', '순경', '필리핀', '마을', '구속영장원주경찰서', '원주', '경찰서', '의심', '의심환자', '목숨', '집유', '유', '흑인', '의료진', '대학', '예비신랑', '신랑', '바다', '암', '암환자', '가수', '가수가요제', '가요제', '각', '인출', '인출책', '책', '주요', '로펌', '응급실', '인원', '회사', '회사원인', '원인', '등에', '여행자', '입건강릉경찰서', '강릉', '둥', '선장', '신도', '관광객', '노부부', '이상인', '건설업체', '회계사', '탈북자', '연령', '구속원주경찰서', '허리', '친딸', '변태', '지방', '지방행정연수원장', '행정', '연수', '주한', '이집트', '카', '카범', '비위', '비위발생', '발생', '이민', '이민우씨', '우', '여조카', '재벌기업', '배달', '노점상', '오토바이', '연구소', '예비역', '노숙자', '유망', '유망기술', '기술', '장모', '과실', '나이롱', '우울증', '납치', '커뮤니티', '건축', '살해', '변호사', '모씨', '서모', '서모씨', '자신', '정신건강', '건강', '베이비', '베이비부', '부', '간부', '잠적', '경기', '윗', '현직', '박', '전반', '증권사', '여승무원', '승무원', '술자리', '구속순간적', '순간적', '이씨', '과학', '카드', '카드회원', '동자승', '미혼남녀', '총장', '상습절도범', '편의점', '농민', '유모', '유모씨', '동료', '파견', '파견직', '직', '집행부', '안팎', '여하', '여하사의', '사의', '배달원', '서비스', '여하사인', '사인', '연령별', '취업준비생인', '생인', '무면허', '무면허운전자', '덜미위조', '포함', '신입', '검찰', '남교사', '여성살인사건', '살인', '가사', '우미가', '미가', '일반', '부녀자', '보험', '보험설계사', '설계사', '점장이', '여성보험설계사', '난민', '상해', '동해', '중고생', '새내기', '환경마화원', '마', '화원', '판사', '공기업', '구직', '구직여성', '재벌그룹', '직장인여성', '재경', '군인', '무직', '여판사', '알선', '알선업체', '복역', '민모씨', '승려', '고모', '고모씨', '관장', '술집', '고도', '고도비만', '비만', '상점', '독서광', '계약', '계약직', '소방관', '심화', '고', '입원', '사망광복절', '광복절', '수강생', '팬', '몽', '골인', '연습', '구속조모씨', '근로자', '교감', '관원', '배', '여사', '휴학', '아동', '투숙객', '유죄', '도박', '신', '신기술', '성폭력', '범죄', '보이스', '보이스피싱', '피', '싱', '흡연', '연구원', '의경', '전체', '골프강사', '배달족', '헌병', '여성노인', '소장', '선로', '뺑소니범', '정비', '정비업체', '장애여성', '백모', '백모씨', '투자', '투자사업가', '헬스', '헬스트레이너', '트레이너', '해경', '인턴', '친부', '낚시꾼', '워터', '파크', '소식', '채팅', '세관', '인출총책', '총책', '손녀', '기간', '자영업자', '여성임', '기업인', '안마사', '에이즈', '청춘', '피해', '과제', '중년인', '범죄자', '사망원인', '중심', '구', '구의원', '의원', '난동', '난동녀', '나이트', '나이트클럽', '애인', '가짜', '구의', '구의월', '월', '민간', '민간보급키', '보급', '키', '광주광역', '광역', '차주', '의무', '의무경찰', '강남', '전', '취', '마사지', '마사지업소', '업소', '초등학생', '호사', '여성업주', '온라인', '대통령', '주한미군', '미군', '해외', '일간', '일간베스트저장소', '베스트', '저장소', '물류', '물류회사', '계곡', '퇴역', '슈퍼', '슈퍼푸드', '푸드', '전역', '전역군인', '대졸', '퇴역군인', '나', '중소기업', '종중', '이상여성', '성인남녀', '패륜아', '중극성팬', '극성', '교도관', '농장', '농장주가', '부인', '교민', '건강식품', '부산', '익사체', '해양', '해양경찰관', '농장주', '흡연율', '로펌들', '종', '종오리', '오리', '내', '농업', '농업인', '인', '금은', '금은방', '도박사이트', '사이트', '신부', '사업', '사업가인', '훈', '캣', '캣맘', '보복', '보복운전자', '병원장', '캣맘으', '박씨', '여가', '캣맘사건', '캣맘를', '맘를', '음식점', '임차인', '날치기', '운전기사', '형제', '박모양', '모양', '고시원', '대리', '대리주차', '기혼남성', '이혼남', '양궁', '구속방과후', '방과', '후', '확보', '특수', '특수절도범', '무죄', '수배자', '총리', '제안', '제안사업', '결혼', '정신지체', '어민', '정신지체아', '지체아', '지구대', '사법', '사법고시생', '고시생', '정신장애', '마지막', '소방장', '초교', '송모씨', '친', '당구장', '지체장애', '성', '성매매', '매매', '김씨', '주임', '유치원', '투신', '구속강릉경찰서', '예비신부', '금', '금수저', '수저', '여인가상', '가상', '미취', '미취업자', '중증장애인', '용접', '용접공이', '공이', '구속기소김', '치매여성', '치매환자', '벌금형', '벌금형변희재', '변', '희재', '벌금형보수논객', '보수', '논객', '트위터', '낚시', '노부모', '아킬레스', '고물상', '민원인', '골동품', '골동품업자', '공립', '공립고교', '노', '노교수', '치과', '치과의사', '분량', '위주', '번', '한국헌법학회', '헌법', '학회', '한국행정연구원', '유학파', '인기', '신장', '식자', '회장', '여성고객', '상가', '상가털이', '협력', '협력업체', '중년여성', '비료', '비료업체', '여신도', '박살', '박살수배중', '친모', '대만인', '원칙', '부문', '인도네시아', '수개월', '수개월간', '간', '정책', '정책과제', '가정', '가정폭력', '인도네시아인', '이집트인', '여경', '인구', '고아', '오늘', '정신병', '자가', '조사전', '금융관행', '관행', '약대', '기수', '치매질환', '질환', '박사', '논쟁', '주범', '전문털이범', '동호회', '태권도', '식당주인', '유부녀', '북브로커', '브로커', '광화문', '시각장애', '김진태', '검찰총장', '불자', '전단', '전단배포', '배포', '아르바이트', '아르바이트생', '생', '전후일', '빈집', '국민', '다단계', '원로', '호텔', '국', '국회의', '회의', '태국인', '혁신안', '안', '싱글족', '족', '억', '억대', '죽음', '예술인', '신원확인지난달', '확인', '주차관리인은', '인은', '열차', '제약', '제약회사', '언어', '언어재활사가', '재활', '사가', '프로그래머', '운영', '사내', '무장', '무장괴한', '괴한', '괴물', '총괄', '총괄책', '흡연자', '순천', '순천향', '여행사', '워킹', '워킹맘', '루', '루마니아인', '마니아', '구속주사기', '주사기', '불구속', '동창생']
vehicle = ['헬기', '버스', '승용차', '중고차', '차']
ambiguous = ['모두', '이상', '이하', '조사', '이후', '등']


count = 0
for i in total:
    #if count == 1000:
    #    break

    text_list.append(i)

    count = count + 1

'''
for text in text_list:
    s = pattern_kor.search(text)
    if s.group() != text:
        #print(text)
        fw.write(text)
    else:
        print('only text')
'''

noun_list = []
noun_str_list = []

for text in text_list:
    s = pattern_short.findall(text)
    l = pattern_long.findall(text)

    if s:
        #fw.write(text)
        for i1, i2 in zip(s,l):
            temp = kkma.nouns(i1)


            print(l, end='')
            print('\t\t\t', end='')


            for j in range(3, len(temp)):
                print(temp[j] + ' ', end='')
                if temp[j] in noun_list:
                    continue

                noun_list.append(temp[j])

            print('\n')

print(noun_list)
print('\n총 개수 : ' + str(len(noun_list)))


fr.close()
fw.close()
